[
    {
      "index": 1,
      "name": "When waking up",
      "english": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection.",
      "arabic": "الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور"
    },
    {
      "index": 2,
      "name": "Supplication when wearing a garment",
      "english": "All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself.",
      "arabic": "الحمدُ للهِ الّذي كَساني هذا (الثّوب) وَرَزَقَنيه مِنْ غَـيـْرِ حَولٍ مِنّي وَلا قـوّة "
    },
    {
      "index": 3,
      "name": "Supplication said when wearing a new garment",
      "english": "O Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made.",
      "arabic": "اللّهُـمَّ لَـكَ الحَـمْـدُ أنْـتَ كَسَـوْتَنيهِ، أََسْأََلُـكَ مِـنْ خَـيرِهِ وَخَـيْرِ مَا صُنِعَ لَـه، وَأَعوذُ بِكَ مِـنْ شَـرِّهِ وَشَـرِّ مـا صُنِعَ لَـهُ"
    },
    {
      "index": 4,
      "name": "Supplication said to someone wearing a new garment",
      "english": "May you wear it out and Allah تعالى replace it (with another).’ The intended meaning: A supplication for long life.",
      "arabic": "تُبْـلي وَيُـخْلِفُ اللهُ تَعَالى "
    },
    {
      "index": 5,
      "name": "Before undressing",
      "english": "In the name of Allah.",
      "arabic": "بِسْمِ الله "
    },
    {
      "index": 6,
      "name": "Before entering the toilet",
      "english": "(In the name of Allah).  O Allah, I take refuge with you from all evil and evil-doers.",
      "arabic": "(بِسْمِ الله ) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث"
    },
    {
      "index": 7,
      "name": "After leaving the toilet",
      "english": "I ask You (Allah) for forgiveness.",
      "arabic": " غُفْـرانَك "
    },
    {
      "index": 8,
      "name": "When starting ablution",
      "english": "In the name of Allah.",
      "arabic": "بِسْمِ الله "
    },
    {
      "index": 9,
      "name": "Upon completing the ablution",
      "english": "I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger.",
      "arabic": "أَشْهَدُ أَنْ لا إِلَـهَ إِلاّ اللهُ وَحْدَهُ لا شَريـكَ لَـهُ وَأَشْهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُـه"
    },
    {
      "index": 10,
      "name": "When leaving the home",
      "english": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.",
      "arabic": "بِسْمِ اللهِ ، تَوَكَّلْـتُ عَلى اللهِ وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله "
    },
    {
      "index": 11,
      "name": "Upon entering the home",
      "english": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.",
      "arabic": "بِسْـمِ اللهِ وَلَجْنـا، وَبِسْـمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا "
    },
    {
      "index": 12,
      "name": "Supplication when going to the mosque",
      "english": "O Allah, place within my heart light, and upon my tongue light, and within my ears light, and within my eyes light, and place behind me light and in front of me light and above me light and beneath me light.  O Allah, bestow upon me light.",
      "arabic": "اللّهُـمَّ اجْعَـلْ في قَلْبـي نورا ، وَفي لِسـاني نورا، وَاجْعَـلْ في سَمْعي نورا، وَاجْعَـلْ في بَصَري نورا، وَاجْعَـلْ مِنْ خَلْفي نورا،  وَمِنْ أَمامـي نورا، وَاجْعَـلْ مِنْ فَوْقـي نورا ، وَمِن تَحْتـي نورا .اللّهُـمَّ أَعْطِنـي نورا "
    },
    {
      "index": 13,
      "name": "Upon entering the mosque",
      "english": "I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil. In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, open the gates of Your mercy for me.",
      "arabic": "عوذُ باللهِ العَظيـم وَبِوَجْهِـهِ الكَرِيـم وَسُلْطـانِه القَديـم مِنَ الشّيْـطانِ الرَّجـيم،[ بِسْـمِ الله، وَالصَّلاةُ] [وَالسَّلامُ عَلى رَسولِ الله]، اللّهُـمَّ افْتَـحْ لي أَبْوابَ رَحْمَتـِك"
    },
    {
      "index": 14,
      "name": "Upon leaving the mosque",
      "english": "In the name of Allah, and prayers and peace be upon the Messenger of Allah.  O Allah, I ask You from Your favour.  O Allah, guard me from the accursed devil.",
      "arabic": "بِسمِ الله وَالصّلاةُ وَالسّلامُ عَلى رَسولِ الله، اللّهُـمَّ إِنّـي أَسْأَلُكَ مِـنْ فَضْـلِك، اللّهُـمَّ اعصِمْنـي مِنَ الشَّيْـطانِ الرَّجـيم"
    },
    {
      "index": 15,
      "name": "Supplications related to the athan (the call to prayer)",
      "english": "come to prayer, come to success’ instead, one should say: لا حَـوْلَ وَلا قُـوَّةَ إِلاّ بِالله",
      "arabic": "One repeats just as the mu-aththin (one who calls to prayer) says, except when he says: حَـيَّ عَلـى الصَّلاة (أَو) حَـيَّ عَلـى الْفَـلاح"
    },
    {
      "index": 16,
      "name": "Supplication at the start of the prayer (after takbeer)",
      "english": "O Allah, distance me from my sins just as You have distanced The East from The West, O Allah, purify me of my sins as a white robe is purified of filth, O Allah, cleanse me of my sins with snow, water, and ice.",
      "arabic": "اللّهُـمَّ باعِـدْ بَيـني وَبَيْنَ خَطـايايَ كَما باعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ ، اللّهُـمَّ نَقِّنـي مِنْ خَطايايَ كَمـا يُـنَقَّى الثَّـوْبُ الأَبْيَضُ مِنَ الدَّنَسْ ، اللّهُـمَّ اغْسِلْنـي مِنْ خَطايـايَ بِالثَّلـجِ وَالمـاءِ وَالْبَرَدْ "
    },
    {
      "index": 17,
      "name": "While bowing in prayer (ruku)",
      "english": "How perfect my Lord is, The Supreme. (three times)",
      "arabic": "سُبْـحانَ رَبِّـيَ الْعَظـيم . (ثلاثاً)"
    },
    {
      "index": 18,
      "name": "Upon rising from the bowing position",
      "english": "May Allah answer he who praises Him.’ This supplication is to be made while rising.",
      "arabic": "سَمِـعَ اللهُ لِمَـنْ حَمِـدَه "
    },
    {
      "index": 19,
      "name": "Supplication whilst prostrating (sujood)",
      "english": "How perfect my Lord is, The Most High. (three times)",
      "arabic": "سُبْـحانَ رَبِّـيَ الأَعْلـى . (ثلاثاً )"
    },
    {
      "index": 20,
      "name": "Supplication between the two prostrations",
      "english": "My Lord forgive me, My Lord forgive me.",
      "arabic": "رَبِّ اغْفِـرْ لي  ، رَبِّ اغْفِـرْ لي "
    },
    {
      "index": 21,
      "name": "Supplication when prostrating due to recitation of the Quran",
      "english": "My face fell prostrate before He who created it and brought forth its faculties of hearing and seeing by His might and power. So Blessed is Allah, the best of creators.",
      "arabic": "سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللهُ أَحسَنُ الْخَالِقِي"
    },
    {
      "index": 22,
      "name": "The Tashahhud",
      "english": "At-tahiyyat is for Allah. All acts of worship and good deeds are for Him. Peace and the mercy and blessings of Allah be upon you O Prophet. Peace be upon us and all of Allah's righteous servants. I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger.’ At-tahiyyat: all words which indicate the glorification of Allah. His eternal existence, His perfection and His sovereignty.  ",
      "arabic": "التَّحِيّـاتُ للهِ وَالصَّلَـواتُ والطَّيِّـبات ، السَّلامُ عَلَيـكَ  أَيُّهـا النَّبِـيُّ  وَرَحْمَـةُ اللهِ وَبَرَكـاتُه ، السَّلامُ عَلَيْـنا وَعَلـى عِبـادِ كَ الصَّـالِحـين . أَشْـهَدُ أَنْ لا إِلـهَ إِلاّ الله ، وَأَشْـهَدُ أَنَّ مُحَمّـداً عَبْـدُهُ وَرَسـولُه"
    },
    {
      "index": 23,
      "name": "Prayers upon the Prophet (saw) after the tashahhud",
      "english": "O Allah, send prayers upon Muhammad and the followers of Muhammad, just as You sent prayers upon Ibraheem and upon the followers of Ibraheem.  Verily, You are full of praise and majesty. O Allah, send blessings upon Mohammad and upon the family of Muhammad, just as You sent blessings upon Ibraheem and upon the family of Ibraheem.  Verily, You are full of praise and majesty.’ send prayers: praise and exalt him in the highest and superior of gatherings: that of the closest angels to Allah. (al) has been translated in it’s broadest sense: some scholars are of the view that the meaning here is more specific and that it means: his (saw) followers from among his family.",
      "arabic": "اللّهُـمَّ صَلِّ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّد، كَمـا صَلَّيـتَ عَلـىإبْراهـيمَ وَعَلـى آلِ إبْراهـيم، إِنَّكَ حَمـيدٌ مَجـيد ، اللّهُـمَّ بارِكْ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّـد،  كَمـا بارِكْتَ عَلـىإبْراهـيمَ وَعَلـى آلِ إبْراهيم، إِنَّكَ حَمـيدٌ مَجـيد "
    },
    {
      "index": 24,
      "name": "Supplication said after the last tashahhud and before salam",
      "english": "O Allah, I take refuge in You from the punishment of the grave, from the torment of the Fire, from the trials and tribulations of life and death and from the evil affliction of Al-Maseeh Ad-Dajjal.",
      "arabic": "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ مِـنْ عَذابِ القَـبْر، وَمِـنْ عَذابِ جَهَـنَّم، وَمِـنْ فِتْـنَةِ  المَحْـيا وَالمَمـات، وَمِـنْ شَـرِّ فِتْـنَةِ  المَسيحِ الدَّجّال "
    },
    {
      "index": 25,
      "name": "Remembrance after salam",
      "english": "I ask Allah for forgiveness. (three times) O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of majesty and honour. AS-Salam: The One Who is free from all defects and deficiencies.",
      "arabic": "أَسْـتَغْفِرُ الله .  (ثَلاثاً) اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ، تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام "
    },
    {
      "index": 26,
      "name": "Supplication for seeking guidance in forming a decision or choosing the proper course...etc (Al-Istikharah)",
      "english": "O Allah, I seek Your counsel by Your knowledge and by Your power I seek strength and I ask You from Your immense favour, for verily You are able while I am not and verily You know while I do not and You are the Knower of the unseen.  O Allah, if You know this affair -and here he mentions his need- to be good for me in relation to my religion, my life, and end, then decree and facilitate it for me, and bless me with it, and if You know this affair to be ill for me towards my religion, my life, and end, then remove it from me and remove me from it, and decree for me what is good wherever it be and make me satisfied with such. One who seeks guidance from his Creator and consults his fellow believers and then remains firm in his resolve does not regret, for Allah has said: وَشـاوِرْهُـم في الأمْـرِ فَـإِذا عَـزَمْـتَ فَتَوَكّـلْ عَلـى الله( ...and consult them in the affair. Then when you have taken a decision, put your trust in Allah... (chapter 3 verse 159)",
      "arabic": "On the authority of Jabir Ibn Abdullah (ra) he said: The Prophet would instruct us to pray for guidance in all of our concerns, just as he would teach us a chapter from the Quran. He (saw) would say If any of you intends to undertake a matter then let him pray two supererogatory units (two rakah nafilah) of prayer and after which he should supplicate: اللّهُـمَّ إِنِّـي أَسْتَخيـرُكَ بِعِاْـمِك، وَأسْتَقْـدِرُكَ بِقُـدْرَتِـك، وَأَسْـألُـكَ مِنْ فَضْـلِكَ العَظـيم، فَإِنَّـكَ تَقْـدِرُ وَلا أَقْـدِر، وَتَـعْلَـمُ وَلا أَعْلَـم، وَأَنْـتَ عَلاّمُ الغُـيوب، اللّهُـمَّ إِنْ كُنْـتَ تَعْـلَمُ أَنَّ هـذا الأمْـرَ- وَيُسَـمِّي حاجَتَـه - خَـيْرٌ لي في دينـي وَمَعـاشي وَعاقِـبَةِ أَمْـري، فَاقْـدُرْهُ لي وَيَسِّـرْهُ لي ثـمَّ بارِكْ لي فيـه، وَإِنْ كُنْـتَ تَعْـلَمُ أَنَّ هـذا الأمْـرَ شَـرٌ  لي في دينـي وَمَعـاشي وَعاقِـبَةِ أَمْـري، فَاصْرِفْـهُ وَاصْرِفْني عَنْـهُ وَاقْـدُرْ لي الخَـيْرَ  حَيْـثُ كانَ ثُـمَّ أَرْضِـني بِـه "
    },
    {
      "index": 27,
      "name": "Remembrance said in the morning and evening",
      "english": "'We have reached the evening and at this very time unto Allah belongs all sovereignty, and all praise is for Allah.  None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. My Lord, I ask You for the good of this night and the good of what follows it and I take refuge in You from the evil of this night and the evil of what follows it.  My Lord, I take refuge in You from laziness and senility.  My Lord, I take refuge in You from torment in the Fire and punishment in the grave.''We have reached the morning and at this very time unto Allah belongs all sovereignty...'",
      "arabic": "In the evening: أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ  وَعَـذابٍ في القَـبْر ....likewise, one says in the morning: أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله...."
    },
    {
      "index": 28,
      "name": "Remembrance before sleeping",
      "english": "‘When retiring to his bed every night, the Prophet (S) would hold his palms together, spit (A form of spitting comprising mainly of air with little spittle) in them, recite the last three chapters (Al-Ikhlas, Al-Falaq, An-Nas) of the Quran and then wipe over his entire body as much as possible with his hands, beginning with his head and face and then all parts of the body, he would do this three times.’",
      "arabic": "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيْهِمَا فَيَقْرَأُ: بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ {قُلْ هُوَ اللَّه أَحَدٌ * اللَّه الصَّمَدُ * لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ} بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ {قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِنْ شَرِّ مَا خَلَقَ * وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ } بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيْمِ {قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ * مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسِ } ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقْبَلَ مِنْ جَسَدِهِ ( يَفْعَلُ ذَلِكَ ثَلاثَ مَرَّاتٍ )"
    },
    {
      "index": 29,
      "name": "Supplication when turning over during the night",
      "english": "Aisha narrated that the Messenger of Allah (saw) used to say at night if he turned during sleep: ‘None has the right to be worshipped except Allah, The One, AL-Qahhar.Lord of the heavens and the Earth and all between them, The Exalted in Might, The Oft-Forgiving.’AL-Qahhar:The One Who has subdued all of creation and Whom all of creation are subservient to. All movements occur by His will.",
      "arabic": "لا إِلَهَ~َ إِلاَّ اللَّهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأَرْضِ وَمَا بَيْنَهُمَا، العَزِيْزُ الغَفَّارُ"
    },
    {
      "index": 30,
      "name": "Upon experiencing unrest, fear, apprehensiveness and the like during sleep",
      "english": "‘I take refuge in the perfect words of Allah from His anger and punishment, and from the evil of His servants, and from the madness and appearance of devils.’",
      "arabic": "أَعُوْذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِه ِِ وَعِقَابِهِ، وَشَرِّ عِبَادِه ِِ وَمِنْ هَمَزَاتِ الشَّيْاطِيْنِ وَأَنْ يَحْضُرُوْنَ."
    },
    {
      "index": 31,
      "name": "Upon seeing a good dream or a bad dream",
      "english": "‘The righteous dream is from Allah and the bad dream is from the devil, so if anyone sees something which pleases him then he should only relate it to one whom he loves...'Summary of what to do upon having a bad dream:Spit on your left three timesSpit: A form of spitting comprising mainly of air with little spittle.Seek refuge in Allah from shaytan and the evil of what you sawDo not relate it to anyoneTurn and sleep on the opposite side to which you were sleeping on previously.",
      "arabic": "  ينفث عن يساره (ثلاثا)  يستعيذ بالله من الشيطان ومن شر ما رأى (ثلاث مرات)  لا يحدث بها أحدا.  يتحول عن جنبه الذي كان عليه.   يَنْفُثُ عَنْ يَسَارِهِ (ثَلاثاً)   يَسْتَعِيْذُ بِاللهِ مِنَ الشَّيْطَانِ وَمِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ)  لا يُحَدِّثُ بِهَا أَحَداً.  يَتَحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ."
    },
    {
      "index": 32,
      "name": "Qunoot Al-Witr (dua qunoot)",
      "english": "‘O Allah, guide me along with those whom You have guided, pardon me along with those whom You have pardoned, be an ally to me along with those whom You are an ally to and bless for me that which You have bestowed. Protect me from the evil You have decreed for verily You decree and none can decree over You.For surety, he whom you show allegiance to is never abased and he whom You take as an enemy is never honoured and mighty. O our Lord, Blessed and Exalted are You.’  Evil you have decreed: Allah does not create pure evil which does not have any good or contain any benefit, wisdom or mercy at all, nor does He punish anyone without having commited a sin. Something can be good in terms of its creation when viewed in a particular perspective and at the same time be evil when viewed in another way.Allah created the devil and by him, He tests His servants, so there are those who hate the devil, fight him and his way and they stand at enmity towards him and his followers and there are others who are at allegiance with the devil and follow his steps. So evil exists in His creatures by His will and wisdom, not in His actions or act of creating.",
      "arabic": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلا يُقْضَى عَلَيْكَ، إِنَّهُ لا يَذِلُّ مَنْ وَالَيْتَ، [ وَلا يَعِزُّ مَنْ عَادَيْتَ ]، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ."
    },
    {
      "index": 33,
      "name": "Remembrance immediately after salam of the witr prayer",
      "english": "The Messenger of Allah (S) would recite (the following chapters) during the witr prayer suras:[Al-Ala], [Al-kafiroon], [Al-ikhlas]…after giving salam he would supplicate three times: ‘How perfect The King, The Holy One is.’ (three times) ..on the third time he would raise his voice, elongate it and add: ‘Lord of the angles and the Rooh (i.e. Jibraeel).",
      "arabic": "سَبِّحِ اِسْمَ رَبِّكَ الأَعْلَى  (قُلْ يَا أَيُّهَا الكَافِرُوْنَ…)  (قُلْ هُوَ اللهُ أَحَدٌ…)  سبْحَانَ المَلِكِ القُدُّوْسِ (ثَلاثَ مَرَّات) وَالثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ بِهَا صَوْتَهُ، [ رَبِّ المَلائِكَةِ وَالرُّوْحِ]"
    },
    {
      "index": 34,
      "name": "Supplication for anxiety and sorrow (ways to deal with stress)",
      "english": "‘O Allah, I am Your servant, son of Your servant, son of Your maidservant, my forelock is in Your hand (i.e. You have total mastery over), Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Quran the life of my heart and the light of my breast, and a departure for my sorrow and a release for my anxiety.’",
      "arabic": "اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ، مَاض ٍ فِيَّ حُكْمُكَ، عَدْل ٌ فِيَّ قَضَاؤُكَ أَسْأَلُكَ بِكُلِّ اِسْمٍ هُوَ لَكَ سَمَّيْتَ بِه ِِ نَفْسَكَ أَوْ أَنْزَلْتَه ُُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ~ُ أَحَدا ً مِنْ خَلْقِكَ أَوِ اسْتَأْثَرْتَ بِه ِِ فِي عِلْمِ الغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنوْرَ صَدْرِي وَجَلَاءَ حُزْنِي وَذَهَابَ هَمِّي"
    },
    {
      "index": 35,
      "name": "Supplication for one in distress",
      "english": "‘None has the right to be worshipped except Allah Forbearing. None has the right to be worshipped except Allah, Lord of the magnificent throne. None has the right to be worshipped except Allah, Lord of the heavens, Lord of the Earth and Lord of the noble throne.’",
      "arabic": "لا إِلَهََ إِلاَّ اللهُ العَظِيْمُ الحَلِيْمُ، لا إِلَهََ إِلاَّ اللهُ رَبُّ العَرْشِ العَظِيْمِ، لا إِلَهَ~َ إِلاَّ اللهُ رَبُّ السَّمَوَاتِ وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ"
    },
    {
      "index": 36,
      "name": "Upon encountering an enemy or those of authority",
      "english": "‘O Allah, we place You before them and we take refuge in You from their evil.’",
      "arabic": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوْذُ بِكَ مِنْ شُرُوْرِهِمْ"
    },
    {
      "index": 37,
      "name": "Supplication for one afflicted with doubt in his faith",
      "english": "One should seek refuge in AllahOne should renounce that which is causing such doubt.",
      "arabic": "يَسْتَعِيْذُ بِاللهِ"
    },
    {
      "index": 38,
      "name": "Settling a debt",
      "english": "‘O Allah, make what is lawful enough for me, as opposed to what is unlawful, and spare me by Your grace, of need of others.’",
      "arabic": "اللَّهمَّ اكْفِنِي بِحَلالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ"
    },
    {
      "index": 39,
      "name": "Supplication for one afflicated by whisperings in prayer or recitation",
      "english": "Uthman Ibn Al-Aas narrated: I said ‘O Messenger of Allah (saw), verily the devil comes between me and my prayer and recitation making me confused’ The Messenger of Allah (saw) replied ‘That is a devil called Khanzab, so if you sense his presence then seek refuge in Allah from him and spit (A form of spitting comprising mainly of air with little spittle) on your left side three times.’",
      "arabic": "أعوذ بالله من الشيطان الرجيم واتفل على يسارك ( ثلاثا )"
    },
    {
      "index": 40,
      "name": "Supplication for one whose affairs have become difficult",
      "english": "‘O Allah, there is no ease except in that which You have made easy, and You make the difficulty, if You wish, easy.’",
      "arabic": "اللّهُـمَّ لا سَـهْلَ إِلاّ ما جَعَلـتَهُ سَهـلاً، وَأَنْتَ تَجْـعَلُ الْحَـزَنَ إِذا شِـئْتَ سَهـْلاً"
    },
    {
      "index": 41,
      "name": "Upon committing a sin",
      "english": "‘Any servant who commits a sin and as a result, performs ablution, prays two units of prayer (i.e. two rakahs) and then seeks Allah’s forgiveness, Allah would forgive him.’",
      "arabic": "ما من عبد يذنب ذنبا فيحسن الطهور، ثم يقوم فيصلي ركعتين، ثم يستغفر الله إلا غفر الله له"
    },
    {
      "index": 42,
      "name": "Supplication for expelling the devil and his whisperings",
      "english": "Seeking refuge from him.",
      "arabic": "الإستعاذة بالله منه"
    },
    {
      "index": 43,
      "name": "Supplication when stricken with a mishap or overtaken by an affair",
      "english": "‘Allah has decreed and what He wills, He does.’",
      "arabic": "قَدَّرَ اللَّهُ وَمَا شَاءَ فَعَلَ"
    },
    {
      "index": 44,
      "name": "Placing children under Allah's protection",
      "english": "Ibn Abbas related that the Messenger of Allah (saw) used to commend Al-Hasan and Al-Husayn to Allah’s protection, saying:‘I commend you two to the protection of Allah’s perfect words from every devil, vermin, and every evil eye.’",
      "arabic": "كان رسول الله صلى الله عليه وسلم يعوذ الحسن والحسين:أُعِيْذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَان ٍ وَهَامَّة، ٍ وَمِنْ كُلِّ عَيْن ٍ لامَّة"
    },
    {
      "index": 45,
      "name": "When visiting the sick",
      "english": "When the Prophet (saw) would enter upon a sick person, he would say:‘Never mind, may it (the sickness) be a purification, if Allah wills.’",
      "arabic": "لا بَأْسَ طَهُوْر ٌ إِنْ شَاءَ ال"
    },
    {
      "index": 46,
      "name": "Excellence of visiting the sick",
      "english": "‘Ali Ibn Abi Talib (ra) related that he heard the Messenger of Allah (saw) say:‘If a man calls on his sick Muslim brother, it is as if he walks reaping the fruits of Paradise until he sits, and when he sits he is showered in mercy, and if this was in the morning, seventy thousand angles send prayers upon him until the evening, and if this was in the evening, seventy thousand angles send prayers upon him until the morning.’",
      "arabic": "قَالَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: \" إِذَا عَادَ الرَّجُلُ أَخَاهُ المُسْلِمَ مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ فَإِذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ، فَإِنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُوْنَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ، وَإِنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُوْنَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ"
    },
    {
      "index": 47,
      "name": "Supplication of the sick who have renounced all hope of life",
      "english": "‘O Allah, forgive me, have mercy upon me and unite me with the higher companions.’Refer to the Quran, chapter 4, verse: 69",
      "arabic": "اللَّهمَّ اغْفِرْ لِي وَارْحَمْنِي وَأَلْحِقْنِي بِالرَّفِيْقِ الأَعْلَى"
    },
    {
      "index": 48,
      "name": "Instruction for the one nearing death",
      "english": "Those around the sick should instruct and encourage him to say the shahadah.‘He whose last words are:‘None has the right to be worshipped except Allah. ...will enter Paradise.’",
      "arabic": "لا إِلَهََ إِلاَّ ال"
    },
    {
      "index": 49,
      "name": "Supplication for one afflicted by a calamity",
      "english": "‘To Allah we belong and unto Him is our return.O Allah, recompense me for my affliction and replace it for me with something better.’",
      "arabic": "إِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُوْنَ، اللَّهمَّ أْجُرْنِي فِي مُصِيْبَتِي، وَاخْلُفْ لِي خَيْرا ً مِنْهَا"
    },
    {
      "index": 50,
      "name": "When closing the eyes of the deceased",
      "english": "‘O Allah, forgive (mention the name of the deceased here) and raise his rank among the rightly guided, and be a successor to whom he has left behind, and forgive us and him O Lord of the worlds.  Make spacious his grave and illuminate it for him.’",
      "arabic": "اللَّهمَّ اغْفِرْ لِ-فُلان ٍ بِاسْمِهِ- وَارْفَعْ دَرَجَتَه ُُ فِي المَهْدِيِّيْنَ، وَاخْلُفْهُ فِي عَقِبِه ِِ فِي الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَه ُُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَه ُُ فِي قَبْرِه ِِ وَنَوِّرْ لَه ُُ فِيْهِ"
    },
    {
      "index": 51,
      "name": "Supplication for the deceased at the funeral prayer",
      "english": " ‘O Allah, forgive and have mercy upon him, excuse him and pardon him, and make honourable his reception. Expand his entry, and cleanse him with water, snow, and ice, and purify him of sin as a white robe is purified of filth.  Exchange his home for a better home, and his family for a better family, and his spouse for a better spouse. Admit him into the Garden, protect him from the punishment of the grave and the torment of the Fire.’",
      "arabic": "اللَّهمَّ اغْفِرْ لَه ُُ وَارْحَمْهُ، وَعَافِه ِِ وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ، وَنَقِّه ِِ مِنَ الخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْرا ً مِنْ دَارِهِ، وَأَهْلاً خَيْرا ً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْرا ً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ وَعَذَابِ النَّار"
    },
    {
      "index": 52,
      "name": "Supplication for the advancement of reward during the funeral prayer",
      "english": "This supplication is made when the deceased is a baby/child (i.e. one not having reached the age of puberty).After seeking forgiveness for the deceased, one can say:‘O Allah, make him a preceding reward and a stored treasure for his parents, and an answered intercessor. O Allah, through him, make heavy their scales and magnify their reward.  Unite him with the righteous believers, place him under the care of Ibraheem, and protect him by Your mercy from the torment of Hell.’",
      "arabic": "اللَّهمَّ اجْعَلْهُ فَرَطا ً وَذُخْرا ً لِوَالِدَيْهِ، وَشَفِيْعا ً مُجَابا، ً اللَّهمَّ ثَقِّلْ بِه ِِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ~ِ أُجُوْرَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المؤْمِنِيْنَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيْمَ، وَقِه ِِ بِرَحْمَتِكَ عَذَابَ الجَحِيْمِ"
    },
    {
      "index": 53,
      "name": "Condolence",
      "english": "‘Verily to Allah, belongs what He took and to Him belongs what He gave, and everything with Him has an appointed time…and then he r ordered for her to be patient and hope for Allah’s reward.’The words (faltasbir waltahtasib) are commands in the feminine 3rd person form, so they will need to be changed in respect to whom is being addressed....and one can also say:‘May Allah magnify your reward, make better your solace and forgive your deceased.’Note: This is the saying of some of the scholars, not a hadeeth.",
      "arabic": "إِنَّ للهِ مَا أَخَذَ، وَلَه ُُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَه ُُ بِأَجَل ٍ مُسَمّى.ً.. فَلْتَصْبِرْ وَلْتَحْتَسِبْ. أَعْظَمَ اللَّهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتِكَ"
    },
    {
      "index": 54,
      "name": "Placing the deceased in the grave",
      "english": " ‘In the name of Allah and upon the sunnah of the Messenger of Allah.’",
      "arabic": "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُوْلِ ال"
    },
    {
      "index": 55,
      "name": "After burying the deceased",
      "english": "‘After the Prophet (saw) would bury the deceased he would stand by the grave and say: ‘Seek forgiveness for your brother and pray that he remains firm, for he is now being questioned’.’",
      "arabic": "اللَّهُمَّ اغْفِرْ لَهُ, اللَّهُمَّ ثَبِّتْهُ"
    },
    {
      "index": 56,
      "name": "Visiting the graves",
      "english": " ‘Peace be upon you all, O inhabitants of the graves, amongst the believers and the Muslims. Verily we will, Allah willing, be united with you, we ask Allah for well-being for us and you.’",
      "arabic": "السَّلامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ المُؤْمِنِيْنَ وَالمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاحِقُوْنَ، نَسْأَلُ اللَّهَ لَنَا وَلَكُمُ العَافِيَةَ"
    },
    {
      "index": 57,
      "name": "Prayer said during a wind storm",
      "english": " ‘O Allah, I ask You for it’s goodness and I take refuge with You from it’s evil.’",
      "arabic": "اللَّهمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا"
    },
    {
      "index": 58,
      "name": "Supplication upon hearing thunder",
      "english": "When Abdullah Ibn Az-Zubayr (ra) used to hear thunder he would stop talking and say:‘How perfect He is, (The One) Whom the thunder declares His perfection with His praise, as do the angels out of fear of Him.’",
      "arabic": "سُبْحانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ"
    },
    {
      "index": 59,
      "name": "Supplication for rain",
      "english": "‘O Allah, send upon us helpful, wholesome and healthy rain, beneficial not harmful rain, now, not later.’",
      "arabic": "اللَّهمَّ اسْقِنَا غَيْثا ً مُغِيْثا ً مَرِيْئا ً مُرِيْعا، ً نَافِعاً غَيْرَ ضَارّ،ٍ عَاجِلاً غَيْرَ آجِل.ٍ"
    },
    {
      "index": 60,
      "name": "Supplication said when it rains",
      "english": " ‘O Allah, may it be a beneficial rain cloud.’",
      "arabic": "اللَّهمَّ صَيِّبا ً نَافِعا.ً"
    },
    {
      "index": 61,
      "name": "After rainfall",
      "english": "‘We have been given rain by the grace and mercy of Allah.’",
      "arabic": "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ"
    },
    {
      "index": 62,
      "name": "Asking for clear skies",
      "english": "‘O Allah, let the rain fall around us and not upon us, O Allah, (let it fall) on the pastures, hills, valleys and the roots of trees.’",
      "arabic": "للَّهمَّ حَوَالَيْنَا وَلا عَلَيْنَا، اللَّهمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُوْنِ الأَوْدِيَةِ، وَمَنابِتِ الشَّجَر"
    },
    {
      "index": 63,
      "name": "Upon sighting the crescent moon",
      "english": "‘Allah is the greatest. O Allah, let the crescent loom above us in safety, faith, peace, and Islam, and in agreement with all that You love and pleases You. Our Lord and your Lord is Allah.’",
      "arabic": "اللَّهُ أَكْبَرُ، اللَّهمَّ أَهِلَّه ُُ عَلَيْنَا بِالأَمْنِ وَالإِيْمَانِ، وَالسَّلامَةِ وَالإِسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ وَتَرْضَى، رَبُّنَا وَرَبُّكَ ال"
    },
    {
      "index": 64,
      "name": "Upon breaking fast",
      "english": " ‘The thirst has gone and the veins are quenched, and reward is confirmed, if Allah wills.’",
      "arabic": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوْقُ، وَثَبَتَ الأَجْرُ إِنْ شَاءَ ٱللَّٰهُ"
    },
    {
      "index": 65,
      "name": "Supplication before eating",
      "english": "‘When you are about to eat, you should say:‘In the name of Allah...and if you forget to say it before starting, then you should say (when you remember):‘In the name of Allah in it’s beginning and end.’",
      "arabic": "بِسْمِ اللَّهِ. بِسْمِ اللَّهِ فِي أَوَّلِه ِِ وَآخِرِهِ."
    },
    {
      "index": 66,
      "name": "Upon completing the meal",
      "english": " ‘All praise is for Allah who fed me this and provided it for me without any might nor power from myself.’",
      "arabic": "الحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيْهِ مِنْ غَيْرِ حَوْل ٍ مِنِّي وَلا قُوَّة.ٍ "
    },
    {
      "index": 67,
      "name": "Supplication of the guest for the host",
      "english": " ‘O Allah, bless for them, that which You have provided them, forgive them and have mercy upon them.’",
      "arabic": "اللَّهمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ."
    },
    {
      "index": 68,
      "name": "Supplication said to one offering a drink or to one who intended to do that",
      "english": "‘O Allah, feed him who fed me, and provide with drink him who provided me with drink.’",
      "arabic": "اللَّهمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي"
    },
    {
      "index": 69,
      "name": "Supplication said when breaking fast in someone's home",
      "english": "‘May the fasting break their fast in your home, and may the dutiful and pious eat your food, and may the angles send prayers upon you.’",
      "arabic": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُوْنَ وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ"
    },
    {
      "index": 70,
      "name": "Supplication said by one fasting when presented with food and does not break his fast",
      "english": "‘If you are not invited (to a meal) then answer.  If  you happen to be fasting, then supplicate (for those present) and if you are not fasting, then eat.’",
      "arabic": "إِذَا دُعِيَ أَحَدَكُمْ فَلْيُجِبْ، فَإِنْ كَانَ صَائِماً فَلْيَصِلَ وَإِنْ كَانَ مُفْطِراً فَلْيَطْعَمْ. وَمَعَنَى فَليَصِلَ أَي فَلْيَدَعَ."
    },
    {
      "index": 71,
      "name": "Supplication said upon seeing the early or premature fruit",
      "english": "‘O Allah, bless our fruit for us, bless our town for us, bless our saa for us and bless our mudd for us.’  A saa is equivalent to four mudds and a mudd is equivalent to a dry measure of an average man’s two palms.",
      "arabic": "اللَّهمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا"
    },
    {
      "index": 72,
      "name": "Supplication said upon sneezing",
      "english": "‘When one of you sneezes he should say:‘All praise if for Allah.’...and his brother or companion should say to him:‘May Allah have mercy upon you.’‘May Allah guide you and rectify your condition.’",
      "arabic": "إِذَا عَطَسَ أَحَدَكُمْ فَلْيَقُلْ: الحَمْدُ للهِ.، وَلْيَقُلْ لَهُ أَخُوْهُ أَوْ صَاحِبُه:ُ يَرْحَمُكَ اللَّهُ. يَهْدِيْكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ"
    },
    {
      "index": 73,
      "name": "Supplication said to the newlywed",
      "english": "‘May Allah bless for you (your spouse) and bless you, and may He unite both of you in goodness.’",
      "arabic": "بَارَكَ اللَّه ُُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْر.ٍ"
    },
    {
      "index": 74,
      "name": "The groom's supplication on the wedding night or when buying an animal",
      "english": "when you marry a woman or buy a maidservant, you should say: ‘O Allah, I ask You for the goodness within her and the goodness that you have made her inclined towards, and I take refuge with You from the evil within her and the evil that you have made her inclined towards.’…and if you buy a camel, then you should take hold of it’s hump and say likewise.’",
      "arabic": "إذا تزوج أحدكم امرأة،أو إذا اشترى خادماً فليقل: اللَّهمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ"
    },
    {
      "index": 75,
      "name": "Supplication before sexual intercourse",
      "english": "‘In the name of Allah. O Allah, keep the devil away from us and keep the devil away from what you have blessed us with.’",
      "arabic": "بِسْمِ اللَّهِ اللَّهمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا"
    },
    {
      "index": 76,
      "name": "When angry",
      "english": "‘I take refuge with Allah from the accursed devil.’",
      "arabic": "أَعُوْذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ"
    },
    {
      "index": 77,
      "name": "Supplication said upon seeing someone in trial or tribulation",
      "english": "This supplication is to be said to one’s self, not directly to the one in trial or tribulation.‘All praise is for Allah Who saved me from that which He tested you with and Who most certainly favoured me over much of His creation.’",
      "arabic": "الحَمْدُ للهِ الَّذِي عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثيْر ٍ مِمَّنْ خَلَقَ تَفْضِيْلا.ً "
    },
    {
      "index": 78,
      "name": "Remembrance said at a sitting or gathering",
      "english": "Ibn Umar (ra) said: It would be counted that the Messenger of Allah r would say one hundred times at any one sitting before getting up: ‘O my Lord, forgive me and turn towards me (to accept my repentance). Verily You are The Oft-Returning. The Oft-Forgiving.’",
      "arabic": "رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُوْرُ."
    },
    {
      "index": 79,
      "name": "Supplication for the expiation of sins said at the conclusion of a sitting or gathering (and Supplication for concluding all sittings)",
      "english": "‘How perfect You are O Allah, and I praise You.  I bear witness that None has the right to be worshipped except You.  I seek Your forgiveness and turn to You in repentance.’",
      "arabic": "سُبْحَانَكَ اللَّهمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لا إِلَهََ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ"
    },
    {
      "index": 80,
      "name": "Returning a supplication of forgiveness",
      "english": "‘Abdullah Ibn Sarjis (ra) said: ‘I went to see the Prophet (saw) and ate from his food and then said to him:‘May Allah forgive you, O Messenger of Allah.’he (saw) replied: ‘and you.’",
      "arabic": "غَفَرَ اللَّهُ لَكَ.  وَلَكَ"
    },
    {
      "index": 81,
      "name": "Supplication said to one who does you a favour",
      "english": "‘If someone does you a favour and you say: ‘May Allah reward you with goodness.’…then you have indeed excelled in praising him.’",
      "arabic": "جَزَاكَ اللَّهُ خَيْرا.ً"
    },
    {
      "index": 82,
      "name": "Protection from the Dajjal",
      "english": "‘Whoever memorises the first ten verses of sura Al-Kahf will be protected from Dajjal.’One should also seek refuge with Allah from the tribulations of the Dajjal after the last tashahhud in prayer. (Refer to supplications 55 & 56) ",
      "arabic": "\" من حفظ عشر آيات من أول سورة الكهف عصم من الدجال \" والإستعاذة بالله من الفتنة عقب التشهد الأخير من كل صلاة."
    },
    {
      "index": 83,
      "name": "Supplication said to one who pronounces his love for you, for Allah's sake",
      "english": "‘May He, for whom you have loved me, love you.’",
      "arabic": "أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ"
    },
    {
      "index": 84,
      "name": "Supplication said to one who has offered you some of his wealth",
      "english": "May Allah bless for you, your family and wealth.",
      "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك"
    },
    {
      "index": 85,
      "name": "Supplication said to the debtor when his debt is settled",
      "english": "May Allah bless for you, your family and wealth. Surely commendation and payment are the reward for a loan.",
      "arabic": "بارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّما جَـزاءُ السَّلَفِ الْحَمْدُ والأَداء"
    },
    {
      "index": 86,
      "name": "Supplication for fear of shirk",
      "english": "O Allah, I take refuge in You lest I should commit shirk with You knowingly and I seek Your forgiveness for what I do unknowingly.",
      "arabic": "اللّهُـمَّ إِنّـي أَعـوذُبِكَ أَنْ أُشْـرِكَ بِكَ وَأَنا أَعْـلَمْ، وَأَسْتَـغْفِرُكَ لِما لا أَعْـلَم"
    },
    {
      "index": 87,
      "name": "Returning a supplication after having bestowed a gift or charity upon someone",
      "english": "May Allah bless you all.",
      "arabic": "وَفيكَ بارَكَ الله"
    },
    {
      "index": 88,
      "name": "Forbiddance of ascribing things to omens",
      "english": "O Allah, there is no omen but there is reliance on You, there is no good except Your good and none has the right to be worshipped except You.",
      "arabic": "اللّهُـمَّ لا طَيْـرَ إِلاّ طَيْـرُك، وَلا خَـيْرَ إِلاّ خَـيْرُك، وَلا إِلهَ غَيْـرُك"
    },
    {
      "index": 89,
      "name": "Supplication said when mounting an animal or any means of transport",
      "english": "In the name of Allah and all praise is for Allah. How perfect He is, the One Who has placed this (transport) at our service and we ourselves would not have been capable of that, and to our Lord is our final destiny. All praise is for Allah, All praise is for Allah, All praise is for Allah, Allah is the greatest, Allah is the greatest, Allah is the greatest. How perfect You are, O Allah, verily I have wronged my soul, so forgive me, for surely none can forgive sins except You.",
      "arabic": "بِسْـمِ اللهِ وَالْحَمْـدُ لله، سُـبْحانَ الّذي سَخَّـرَ لَنا هذا وَما كُنّا لَهُ مُقْـرِنين، وَإِنّا إِلى رَبِّنا لَمُنـقَلِبون، الحَمْـدُ لله، الحَمْـدُ لله، الحَمْـدُ لله، اللهُ أكْـبَر، اللهُ أكْـبَر، اللهُ أكْـبَر، سُـبْحانَكَ اللّهُـمَّ إِنّي ظَلَـمْتُ نَفْسي فَاغْـفِرْ لي، فَإِنَّهُ لا يَغْفِـرُ الذُّنوبَ إِلاّ أَنْـت"
    },
    {
      "index": 90,
      "name": "Supplication for travel",
      "english": "Allah is the greatest, Allah is the greatest, Allah is the greatest, How perfect He is, The One Who has placed this (transport) at our service, and we ourselves would not have been capable of that, and to our Lord is our final destiny. O Allah, we ask You for birr and taqwa in this journey of ours, and we ask You for deeds which please You. O Allah, facilitate our journey and let us cover its distance quickly. O Allah, You are The Companion on the journey and The Successor over the family, O Allah, I take refuge with You from the difficulties of travel, from having a change of hearts and being in a bad predicament, and I take refuge in You from an ill fated outcome with wealth and family. [upon returning the same supplication is recited with the following addition :] (We return, repent, worship and praise our Lord.)",
      "arabic": "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفْرِنَا هَذَا الْبِرَّ وَالتَّقْوَى ، وَمِنَ الْعَمَلِ مَا تَرْضَى ، اللَّهُمَّ هَوَّنْ عَلَيْنَا سَفْرِنَا هَذَا وَاطْوَعَّنَّا بَعْدهُ ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ + آيِبُونَ تَائْبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ"
    },
    {
      "index": 91,
      "name": "Supplication upon entering a town or village ...etc",
      "english": "O Allah, Lord of the seven heavens and all that they envelop, Lord of the seven earths and all that they carry, Lord of the devils and all whom they misguide, Lord of the winds and all whom they whisk away. I ask You for the goodness of this village, the goodness of its inhabitants and for all the goodness found within it and I take refuge with You from the evil of this village, the evil of its inhabitants and from all the evil found within it.",
      "arabic": "أللّـهُمَّ رَبَّ السَّـمواتِ السّـبْعِ وَما أَظْلَلَـن، وَرَبَّ الأَراضيـنَ السّـبْعِ وَما أقْلَلْـن، وَرَبَّ الشَّيـاطينِ وَما أَضْلَلْـن، وَرَبَّ الرِّياحِ وَما ذَرَيْـن، أَسْـأَلُـكَ خَيْـرَ هذهِ الْقَـرْيَةِ وَخَيْـرَ أَهْلِـها، وَخَيْـرَ ما فيها، وَأَعـوذُ بِكَ مِنْ شَـرِّها وَشَـرِّ أَهْلِـها، وَشَـرِّ ما فيها"
    },
    {
      "index": 92,
      "name": "When entering the market",
      "english": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise. He gives life and causes death, and He is living and does not die. In His hand is all good and He is over all things, omnipotent.",
      "arabic": "لا إلهَ إلاّ اللّه وحدَهُ لا شريكَ لهُ، لهُ المُلْـكُ ولهُ الحَمْـد، يُحْيـي وَيُميـتُ وَهُوَ حَيٌّ لا يَمـوت، بِيَـدِهِ الْخَـيْرُ وَهوَ على كلّ شيءٍ قدير"
    },
    {
      "index": 93,
      "name": "Supplication for when the mounted animal (or mean of transport) stumbles",
      "english": "In the name of Allah.",
      "arabic": "بِسْـمِ اللهِ "
    },
    {
      "index": 94,
      "name": "Supplication of the traveller for the resident",
      "english": "I place you in the trust of Allah, whose trust is never misplaced.",
      "arabic": "أَسْتَـوْدِعُكُـمُ اللَّهَ الَّذي لا تَضـيعُ وَدائِعُـه"
    },
    {
      "index": 95,
      "name": "Supplication of the resident for the traveller",
      "english": "I place your deen, your faithfulness and the ends of your deeds in the trust of Allah.",
      "arabic": "أَسْتَـوْدِعُ اللَّهَ ديـنَكَ وَأَمانَتَـكَ، وَخَـواتيـمَ عَمَـلِك"
    },
    {
      "index": 96,
      "name": "Remembrance while ascending or descending",
      "english": "While ascending: Allah is the greatest.\nand when descending: How perfect Allah is.",
      "arabic": "اللهُ أَكْـبَر / سُبْـحانَ الله"
    },
    {
      "index": 97,
      "name": "Prayer of the traveller as dawn approaches",
      "english": "May a witness, be witness to our praise of Allah for His favours and bounties upon us. Our Lord, protect us, show favour on us and deliver us from every evil. I take refuge in Allah from the fire.",
      "arabic": "سَمِـعَ سـامِعُ بِحَمْـدِ اللهِ وَحُسْـنِ بَلائِـهِ عَلَيْـنا. رَبَّنـا صـاحِبْـنا وَأَفْـضِل عَلَيْـنا عائِذاً باللهِ مِنَ النّـار"
    },
    {
      "index": 98,
      "name": "Stopping or lodging somewhere",
      "english": "I take refuge in Allah’s perfect words from the evil that He has created.",
      "arabic": "أَعـوذُ بِكَلِـماتِ اللّهِ التّـامّاتِ مِنْ شَـرِّ ما خَلَـق"
    },
    {
      "index": 99,
      "name": "While returning from travel",
      "english": "Allah is the greatest, Allah is the greatest, Allah is the greatest.\nNone has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise, and He is over all things omnipotent. We return, repent, worship and praise our Lord. Allah fulfilled His promise, aided His Servant, and single-handedly defeated the allies.",
      "arabic": "ا للهُ أَكْـبَر، ا للهُ أَكْـبَر، ا للهُ أَكْـبَ لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير، آيِبـونَ تائِبـونَ عابِـدونَ لِرَبِّـنا حـامِـدون، صَدَقَ اللهُ وَعْـدَه، وَنَصَـرَ عَبْـدَه، وَهَزَمَ الأَحْـزابَ وَحْـدَه"
    },
    {
      "index": 100,
      "name": "What to say upon receiving pleasing or displeasing news",
      "english": "All Praise is for Allah by whose favour good works are accomplished.\nAll Praise is for Allah in all circumstances.",
      "arabic": "الْحَمْـدُ للهِ الَّذي بِنِـعْمَتِهِ تَتِـمُّ الصّـالِحات / الْحَمْـدُ للهِ على كُـلِّ حال"
    },
    {
      "index": 101,
      "name": "Excellence of sending prayers upon the Prophet (saw)",
      "english": "The Prophet (saws) said: Whoever sends a prayer upon me, Allah sends ten upon him.",
      "arabic": "اللّهُـمَّ صَلِّ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّد، كَمـا صَلَّيـتَ عَلـىإبْراهـيمَ وَعَلـى آلِ إبْراهـيم، إِنَّكَ حَمـيدٌ مَجـيد ، اللّهُـمَّ بارِكْ عَلـى مُحمَّـد، وَعَلـى آلِ مُحمَّـد، كَمـا بارِكْتَ عَلـىإبْراهـيمَ وَعَلـى آلِ إبْراهيم، إِنَّكَ حَمـيدٌ مَجـيد"
    },
    {
      "index": 102,
      "name": "Excellence of spreading the Islamic greeting",
      "english": "The Messenger of Allah (saws) said: You shall not enter paradise until you believe, and you shall not believe until you love one another. Shall I not inform you of something, if you were to act upon it, you will indeed achieve mutual love for one another? Spread the greeting amongst yourselves.",
      "arabic": "السَّلامُ عَلَيْكُم"
    },
    {
      "index": 103,
      "name": "Supplication said upon hearing a rooster crow or the braying of an ass",
      "english": "If you hear the crow of a rooster, ask Allah for his bounty for it has seen an angel and if you hear the braying of an ass, seek refuge in Allah for it has seen a devil.",
      "arabic": "أَعـوذُ بِاللهِ مِنَ الشَّيْـطانِ الرَّجيـم"
    },
    {
      "index": 104,
      "name": "Supplication upon hearing the barking of dogs at night",
      "english": "If you hear the barking of dogs or the braying of asses at night, seek refuge in Allah for they see what you do not.",
      "arabic": "أَعـوذُ بِاللهِ مِنَ الشَّيْـطانِ الرَّجيـم"
    },
    {
      "index": 105,
      "name": "Supplication said for one you have insulted",
      "english": "O Allah, to any believer whom I have insulted, let that be cause to draw him near to You on the Day of Resurrection.",
      "arabic": "اللهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لهُ قُرْبةً إليكَ يَوْمَ القِيَامةِ"
    },
    {
      "index": 106,
      "name": "The etiquette of praising a fellow Muslim",
      "english": "He (saw) said: If anyone of you is impelled to praise his brother, then he should say: I deem so-and-so to be... and Allah is his reckoner... and I don't praise anyone, putting it (i.e. my praising) forward, in front of Allah's commendation, however I assume him so and so... if he knows that of him.",
      "arabic": ""
    },
    {
      "index": 107,
      "name": "Supplication said between the Yemeni corner and the black stone (at the Kabah)",
      "english": "O our Lord, grant us the best in this life and the best in the next life, and protect us from the punishment of the Fire.",
      "arabic": "رَبَّنَا آتِنَا في الدُّنْيَا حسَنَةً وفي الآخِرَةِ حسَنةً وقِنَا عذَابَ النَّارِ"
    },
    {
      "index": 108,
      "name": "Supplication said when at Mount Safa & Mount Marwah",
      "english": "Indeed Safa and Marwah are from the places of worship of Allah...\nAllah is the greatest, Allah is the greatest, Allah is the greatest.\nI begin with what Allah began with.\nAllah is the greatest, Allah is the greatest, Allah is the greatest.\nNone has the right to be worshipped except Allah, alone, without partner.To Him belongs all sovereignty and praise and He is over all things amnipotent. None has the right to be worshipped except Allah alone.  He fulfilled His promise, aided His Servant and single-handedly defeated the allies.",
      "arabic": "Jabir said when describing the Prophet's (saw) pilgrimage: and when he approached mount Safa he recited: (إِنَّ الصَّفَا والمَرْوَةَ \nمِنْ شَعائرِ الله…)\nأَبْدَأُ بِمَا بَدَأَ اللهُ بِهِ\n...so he started with Safa and climed it until he could see the Kabah, he then faced it and said: اللهُ أكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ\n...and then he would say the following three times making a supplication (one should make a personal supplication) after each time: لَا إِلهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ وهُوَ عَلى كُلِّ شَيءٍ قَديرٌ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ وَهَزَمَ الأَحْزَابَ وَحْدَهُ\n...he (saw) would repeat this action at Marwah."
    },
    {
      "index": 109,
      "name": "The Day of Arafah",
      "english": "None has the right to be worshipped except Allah, alone, without partner. To Him belongs all praise and sovereignty and He is over all things omnipotent.",
      "arabic": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَريكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ عَلَى كُلِّ شَيْءٍ قَديرٌ."
    },
    {
      "index": 110,
      "name": "At the Sacred Site (Al-Mashar Al-Haram)",
      "english": "Jabir said: He (saw) rode Al-Qaswa until he reached Al-Mashar Al-Haram, he then faced the qiblah, supplicated to Allah, and extoled His greatness and oneness. He stood until the sun shone but left before it rose.",
      "arabic": ""
    },
    {
      "index": 111,
      "name": "When throwing each pebble at the Jamarat",
      "english": "Every time the Prophet (saw) threw a pebble at any of the three jamarat, he would say:\nAllah is the greatest\n..on completion of the first jamarah, he advanced a little, stood facing the qiblah, raised his hands and supplicated. He also did this after the second jamarah but not the third.",
      "arabic": "اللهُ أَكْبَرُ"
    },
    {
      "index": 112,
      "name": "At the black stone",
      "english": "The Prophet (saw) circled the Kabah on a camel, every time he reached the black stone he would point to it with his staff and say: Allah is the greatest.",
      "arabic": "اللهُ أَكْبَرُ"
    },
    {
      "index": 113,
      "name": "Supplication made against an enemy",
      "english": "O Allah, Revealer of the Book, Swift at reckoning, defeat the confederates. O Allah, defeat them and convulse them.",
      "arabic": "اللَّهُمَّ مُنْزِلَ الكِتَابِ سَريعَ الحِسابِ اهْزِمَ الأَحْزَابَ اللَّهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ"
    },
    {
      "index": 114,
      "name": "What to say when in fear of a people",
      "english": "O Allah, protect me from them with what You choose.",
      "arabic": "اللَّهُمَّ اكْفِنِيهِمْ بِما شِئْتَ"
    },
    {
      "index": 115,
      "name": "What to say at times of amazement and delight",
      "english": "How perfect Allah is.",
      "arabic": "سُبْحَانَ اللهِ!"
    },
    {
      "index": 116,
      "name": "What to do upon receiving pleasant news",
      "english": "The Prophet (saw) would prostrate in gratitude to Allah (swt) upon receiving news which pleased him or which caused pleasure.",
      "arabic": ""
    },
    {
      "index": 117,
      "name": "What to say and do when feeling some pain in the body",
      "english": "Place your hand at the site of the pain and say: In the name of Allah (3 times). Then supplicate seven times: I take refuge in Allah and within His omnipotence from the evil that I feel and am wary of. (7 times)",
      "arabic": "بِسْمِ اللهِ (ثَلاثاً)\n\nأَعُوذُ باللهِ وَقُدْرَتِهِ مَنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ. (سبع مرات)"
    },
    {
      "index": 118,
      "name": "What to say when in fear of afflicting something or someone with one’s eye",
      "english": "O Allah, send blessing upon him. (This is) that which Allah has willed, there is no power except with Allah.",
      "arabic": "اللّهُـمَّ بارِك عَلَـيه\nما شاءَ الله، لا قُوَّةَ إلاّ بالله"
    },
    {
      "index": 119,
      "name": "Etiquette of retiring for the night",
      "english": "When night falls (i.e. Al-Maghrib), restrain your children (from going out) because at such time the devils spread about. After a period of time has passed, let them be. Shut your doors and mention Allah's name, for verily the devil does not open a shut door, tie up your water-skins and mention Allah's name, cover your vessels with anything and mention Allah's name and put out your lamps.",
      "arabic": ""
    },
    {
      "index": 120,
      "name": "The Talbiyah",
      "english": "Here I am O Allah, (in response to Your call), here I am. Here I am, You have no partner, here I am.  Verily all praise, grace and sovereignty belong to You. You have no partner.",
      "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الحّمْدَ والنِّعْمَةِ، لَكَ والمُلْكُ، لَا شَرِيكَ لَكَ"
    },
    {
      "index": 121,
      "name": "What to say when startled",
      "english": "None has the right to be worshipped except Allah.",
      "arabic": "لا إِلهَ إلاَّ اللهُ"
    },
    {
      "index": 122,
      "name": "What is said to a non-muslim when he sneezes",
      "english": "May Allah guide you and rectify your condition.",
      "arabic": "يَهْدِيكُمْ اللهُ ويُصلِحُ بًالَكُمْ"
    },
    {
      "index": 123,
      "name": "Returning a greeting to a non-muslim",
      "english": "And upon you.",
      "arabic": "وَعَلَـيكُم"
    },
    {
      "index": 124,
      "name": "When insulted while fasting",
      "english": "I am fasting, I am fasting.",
      "arabic": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ"
    },
    {
      "index": 125,
      "name": "When slaughtering or offering a sacrifice",
      "english": "In the name of Allah, and Allah is the greatest.  O Allah, (it is) from You and belongs to You, O Allah, accept this from me.",
      "arabic": "بِسْمِ اللهِ واللهُ أَكْبَرُ اللَّهُمَّ مِنْكَ ولَكَ اللَّهُمَّ تَقَبَّلْ مِنِّي."
    },
    {
      "index": 126,
      "name": "What is said to ward off the deception of the Obstinate Shaytans",
      "english": "I take refuge within Allah’s perfect words which no righteous or unrighteous person can transgress, from all the evil that He has created, made and originated.  (I take refuge) from the evil that descends from the sky and the evil that rises up to it.  (I take refuge) from the evil that is spread on Earth and the evil that springs from her, and I take refuge from the evil of the tribulations of night and day, and the evil of one who visits at night except the one who brings good, O Merciful One.",
      "arabic": "أَعُوذُ بكَلِمَاتِ اللهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجرٌ مِنْ شّرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ وِمنْ شَرِّ مَا يَعْرُجُ فيهَا، ومِن شَرِّ مَا ذَرَأَ في الأَرْضِ ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهارِ، ومِنْ شَرِّ كُلِّ طارِقٍ إِلَّا طَارِقاً يَطْرُقُ بخَيْرٍ يَا رَحْمَنُ"
    },
    {
      "index": 127,
      "name": "Seeking forgiveness and repentance",
      "english": "The Messenger of Allah (saw) said: By Allah, I seek forgiveness and repent to Allah, more than seventy times a day.",
      "arabic": ""
    },
    {
      "index": 128,
      "name": "Excellence of remembrance and glorification of Allah",
      "english": "Abu Hurayrah reported that the Messenger of Allah (saw) said: Whoever says: None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise and He is over all things omnipotent. ...a hundred times during the day, has the reward of freeing ten slaves, a hundred good deeds are recorded for him and a hundred bad deeds are wiped away and he has gained refuge from the devil that day until evening and none shall come with anything better except someone who has done more.",
      "arabic": "لَا إِلهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْد، وهُوَ عَلى كُلِّ شَيءٍ قَديرٌ. (مائة مرة)"
    },
    {
      "index": 129,
      "name": "How the prophet (saw) made tasbeeh",
      "english": "Abdullah ibn Amr said: I saw the prophet (saw) make tasbeeh with his right hand.",
      "arabic": ""
    },
    {
      "index": 130,
      "name": "After every four rakats of Taraweeh prayer",
      "english": "Exalted is the Possessor of the hidden and the manifest dominion. Exalted is the Possessor of Might, Greatness, Reverence, Power, Pride, and Majesty. Exalted is the Master, the Living, the one who neither sleeps nor dies. All-perfect, All-holy, Our Lord, and the Lord of the angels and the souls. O Allah, grant us refuge from the Hellfire. O Granter of refuge, O Granter of refuge, O Granter of refuge.",
      "arabic": "سُبْحَانَ ذِی الْمُلْکِ وَالْمَلَکُوْتِ ط سُبْحَانَ ذِی الْعِزَّةِ وَالْعَظَمَةِ وَالْهَيْبَةِ وَالْقُدْرَةِ وَالْکِبْرِيَآئِ وَالْجَبَرُوْتِ ط سُبْحَانَ الْمَلِکِ الْحَيِ الَّذِی لَا يَنَامُ وَلَا يَمُوْتُ سُبُّوحٌ قُدُّوْسٌ رَبُّنَا وَرَبُّ الْمَلَائِکَةِ وَالرُّوْحِ ط اَللّٰهُمَّ اَجِرْنَا مِنَ النَّارِ يَا مُجِيْرُ يَا مُجِيْرُ يَا مُجِيْر۔"
    },
    {
      "index": 131,
      "name": "After completing Taraweeh prayer",
      "english": "O Allah, we ask You for Paradise and seek refuge in You from the Fire. O Creator of Paradise and Fire, by Your mercy, O Mighty One, O Forgiver, O Generous One, O Concealer [of faults], O Merciful One, O Compeller [of hearts], O Creator, O Maker! O Allah, save us from the Fire! O Rescuer! O Rescuer! O Rescuer! By Your mercy, O Most Merciful of the merciful.",
      "arabic": "اَللَهُمَّ اِنَّا نَسْئَالُكَ الْجَنَّةَ وَ نَعُوْذُبِكَ مِنَ النَّارِ يَا خَالِقَ الْجَنَّةَ وَالنَّارِ- بِرَحْمَتِكَ يَاعَزِيْزُ يَا غَفَّارُ يَا كَرِيْمُ يَا سَتَّارُ يَا رَحِيْمُ يَاجَبَّارُ يَاخَالِقُ يَابَارُّ اَللَّهُمَّ اَجِرْنَا مِنَ النَّارِ يَا مُجِيْرُ يَا مُجِيْرُ يَا مُجِيْرُ- بِرَحْمَتِكَ يَا اَرْحَمَ الرَّحِمِيْنَ"
    },
    {
      "index": 132,
      "name": "Upon starting fast",
      "english": "I intend to keep the fast for tomorrow in the month of Ramadan",
      "arabic": "وَبِصَوْمِ غَدٍ نَّوَيْتُ مِنْ شَهْرِ رَمَضَانَ"
    },
    {
      "index": 133,
      "name": "For The Night of Power",
      "english": "O Allah, You are the Most forgiving, and You love to forgive, so forgive me.",
      "arabic": "الْلَّهُمَّ اِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي"
    },
    {
      "index": 134,
      "name": "For Protection",
      "english": "O Allah, I ask of Your pleasure and for Paradise, and I seek refuge from Your displeasure and from the Hellfire",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ"
    },
    {
      "index": 135,
      "name": "For increasing knowledge",
      "english": "My Lord, increase me in knowledge.",
      "arabic": "رَبِّ زِدْنِي عِلْمًا"
    },
    {
      "index": 136,
      "name": "For Direction",
      "english": "O Allah! Direct me to the Right Path and make me adhere to the Straight Path.",
      "arabic": "اللَّهُمَّ اهْدِني ، وسَدِّدْنِي"
    },
    {
      "index": 137,
      "name": "For Wisdom",
      "english": "O Allah, benefit me with what You have taught me, and teach me that which will benefit me, and increase me in knowledge.",
      "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَ عَلِّمْنِي مَا يَنْفَعُنِي وَ زِدْنِي عِلْمًا"
    },
    {
      "index": 138,
      "name": "For your parents",
      "english": "My Lord, have mercy upon them (parents) as they brought me up [when I was] small.",
      "arabic": "رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا"
    },
    {
      "index": 139,
      "name": "Supplication for health",
      "english": "O Allah, make me healthy in my body. O Allah, preserve for me my hearing. O Allah, preserve for me my sight. There is none worthy of worship but You . O Allah , I seek refuge in You from disbelief and poverty and I seek refuge in You from the punishment of the grave . There is none worthy of worship but You.",
      "arabic": "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ"
    }
  ]